{
  "published": true,
  "date": "2021-12-31T04:56:09.194Z",
  "title": "2021 In Review",
  "body": "This is a longer version of my tweet on my 2021 in review: [](https://twitter.com/khairulnazran/status/1476545981705449473?s=20)<https://twitter.com/khairulnazran/status/1476545981705449473?s=20>\n\nI tend to write down my year in review for many years now since 2016 but never really settled for a structure. This year, let’s have some more structure in the review with some sprint retrospective flavor into it.\n\n### Heading into 2021\n\nMy first moment of 2021 was a subdued firework show from my KLCC-view apartment surrounded by friends. We cheered into the new year, thinking that the pandemic is almost over. Few minutes before, I called my ex-girlfriend (we broke up few days before) to wishing all the best for our separate paths moving forward. My mood: somber but excited\n\n### Highlights in 2021\n\nJanuary - Healing from a breakup, trying to form good habits. \n\nFebruary - Starting running. Started buying crypto \n\nMarch - Birthday. Bought a Switch. 100 days of tracking my habits. Lost a lot of weight \n\nApril - Dating galore \n\nMay - Life changing opportunity showed itself J\n\nune - Interview prep. Fell in love \n\nJuly - Honeymoon period. Submitted resignation \n\nAugust - Side gig galore. Started Axie. Moved into a new apartment \n\nSeptember - Started trading NFTs \n\nOctober - Left BNM, started in Xendit. Gained back the weight I’ve lost xD \n\nNovember - Started DeFi \n\nDecember - Vacation galore, got a new MacBook. Ended the year with a ‘in the green’ portfolio\n\nLooking at the month on month play above, it feels like the first half of the year was a lot of introspection and healing and the second half of the year is super hectic (like the years before...I don’t know why my second half of every year is super hectic)\n\n### Lessons in 2021\n\n1. Take risk. Have conviction. Have patience.\n2. Write your thoughts down all the time.\n3. Invest in your mental health and resiliency especially if you have lofty goals and big ambition\n4. Best way to heal is to start moving forward. Even an inch forward works.\n5. No one moves fast all the time. To move fast, you at times have to go slow\n\n### What Went Well in 2021\n\n1. I managed to achieve my biggest medium term goal since 2017 which is to get a job in a tech startup. I have been grinding my tech skills and network and trying to make do with a sub-optimal work environment for years. Cashing that out in 2021 is amazing.\n2. My habit tracking experiment was a huge success. Too bad I started to drop it when things get a little more hectic...\n3. My relationships with others feels stronger although my general circle gets a little smaller. Quality over quantity I guess\n4. My mental resilience. A stark contrast from last year, I feel my coping mechanisms has been on point and my emotional volatility is more in check. Therapy works!\n5. Crypto. Yes crypto.\n\n### What Could Be Improved\n\n1. Managing my discipline has things get more hectic. I’m a little sad that I gained back most of the weight I lost since beginning of the year. Lockdown made it easy to focus and grind through it but I didn’t seem to fare well.\n2. Building. I...didn’t build as much as I did before. I don’t think I have any notable side projects this year.\n3. Health. I do acknowledge that I haven’t been keeping my health in check in the later part of the year even though I was very on point at the beginning.\n\n### Looking back\n\nIt was a good year with many milestones checked off my list. Going into 2022 and being 29, I’m excited to work towards my next medium term goal, which I will keep to myself for now. Happy new years!",
  "description": "Looking back into 2021",
  "tag": "Yearly review"
}